       IDENTIFICATION DIVISION.
       PROGRAM-ID. num-comments.
       ENVIRONMENT DIVISION.
           INPUT-OUTPUT SECTION.
           FILE-CONTROL.
           SELECT COMMENT-FILE ASSIGN TO "comments.dat"
             ORGANISATION IS LINE SEQUENTIAL.
       DATA DIVISION.
           FILE SECTION.
             FD COMMENT-FILE.
             01 RC-ID PIC XXX.
           WORKING-STORAGE SECTION.
             01 WS-COUNTER PIC 9999.
             01 WS-FILE-IS-ENDED PIC 9 VALUE 0.
             01 WS-SUPPRESS-ZEROS PIC Z(5).
           LINKAGE SECTION.
             01 LS-RETURN-COUNTER PIC 9999.
       PROCEDURE DIVISION USING LS-RETURN-COUNTER.
           
           OPEN INPUT COMMENT-FILE.

           PERFORM UNTIL WS-FILE-IS-ENDED = 1
             READ COMMENT-FILE
             NOT AT END
               ADD 1 TO WS-COUNTER
             AT END MOVE 1 TO WS-FILE-IS-ENDED
           END-PERFORM.
           
          *>  MOVE WS-COUNTER TO LS-RETURN-COUNTER.
          *>  MOVE WS-COUNTER TO WS-SUPPRESS-ZEROS.
          *>  MOVE WS-SUPPRESS-ZEROS TO LS-RETURN-COUNTER.
          *>  MOVE FUNCTION TRIM(LS-RETURN-COUNTER) TO LS-RETURN-COUNTER.

           MOVE WS-COUNTER TO LS-RETURN-COUNTER.
           
           MOVE 0 TO WS-COUNTER.
           MOVE 0 TO WS-FILE-IS-ENDED.

           CLOSE COMMENT-FILE.
 